# SetSheetLayerUserOrigin

## Description
Sets the user origin of the specified sheet layer.

```pascal
FUNCTION SetSheetLayerUserOrigin(
				layerHandle : HANDLE;
				xOrigin     : REAL;
				yOrigin     : REAL) : BOOLEAN;
```

```python

def vs.SetSheetLayerUserOrigin(layerHandle, xOrigin, yOrigin):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|layerHandle|HANDLE||
|xOrigin|REAL||
|yOrigin|REAL||

## Version
Availability: from VectorWorks10.5
## Category
* Layers